Can't move whole Massing. Move the elements within the Massing instead.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotMoveMassing { get; }
  Visual Basic
Public Shared ReadOnly Property CannotMoveMassing As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotMoveMassing {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MassFailures Class
  Autodesk.Revit.DB Namespace